//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

Процедура УстановкаЦенНовыйДокумент(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	ФормаВладелец = ПараметрыВыполненияКоманды.Форма;
	Параметры = Новый Структура("Товары", ПараметрКоманды);

	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаДокумента",
				 Параметры,
				 ФормаВладелец,
				 ФормаВладелец.УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Процедура ИзменениеПоследнейУстановкиЦен(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	ФормаВладелец = ПараметрыВыполненияКоманды.Форма;
	ВидЦены = ФормаВладелец.Элементы["ДКА_Цены"].ТекущиеДанные["ВидЦены"];
	
	ДокументУстановки = ДКА_СобытияФормВызовСервера.ПоследнийДокументУстановкиЦен(ПараметрКоманды, ВидЦены);
	
	Параметры = Новый Структура("Ключ", ДокументУстановки);

	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаДокумента",
				 Параметры,
				 ФормаВладелец,
				 ФормаВладелец.УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

Процедура Настройки(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	ФормаВладелец = ПараметрыВыполненияКоманды.Форма;
//	Параметры = Новый Структура("Товары", ПараметрКоманды);
//
//	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаДокумента",
//				 Параметры,
//				 ФормаВладелец,
//				 ФормаВладелец.УникальныйИдентификатор,
//				 ,
//				 ,
//				 ,
//				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ОписаниеОповещения = Новый ОписаниеОповещения("Заглушка", ЭтотОбъект);
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(ОписаниеОповещения,
														   "Здесь можно будет настроить виды цен и склады",
														   РежимДиалогаВопрос.ОК);
КонецПроцедуры

Процедура Заглушка(Результат, ДополнительныеПараметры) Экспорт

КонецПроцедуры

#КонецОбласти