// @strict-types

//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		

#Область ПрограммныйИнтерфейс

// Возвращает реквизит (таблицу значений) по имени.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -  Форма
//  ИмяТаблицы - Строка - Имя таблицы
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица значений
Функция РеквизитТаблицаЗначений(Форма, ИмяТаблицы) Экспорт
	Возврат Форма[ИмяТаблицы];
КонецФункции

// Возвращает реквизит (список значений) по имени.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -  Форма
//  ИмяСписка - Строка -  Имя списка
// 
// Возвращаемое значение:
// 	СписокЗначений из Произвольный - Список значений
Функция РеквизитСписокЗначений(Форма, ИмяСписка) Экспорт
	Возврат Форма[ИмяСписка];
КонецФункции

#КонецОбласти