//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для передачи в параметрах вспомогательных методов (см. ниже).
//       Соответствует 1 параметру процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки этого отчета,
//       уже сформированные при помощи функции ВариантыОтчетов.ОписаниеОтчета() и готовые к изменению.
//       См. "Свойства для изменения" процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь);
//
// Примеры:
//
//  1. Установка описания варианта.
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    НастройкиВарианта.Описание = НСтр("ru = '<Описание>'");
//
//  2. Отключение варианта отчета.
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    НастройкиВарианта.Включен = Ложь;
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт

	НастройкиОтчета.Включен = Истина;

	// Формирование соответствия с подсистемама для размещения варианта отчета
	ПодсистемыРазмещения = Новый Соответствие;

	ПодсистемыРазмещения.Вставить(Метаданные.НайтиПоПолномуИмени("Подсистема.Продажи"),
								  "Важный");
	ПодсистемыРазмещения.Вставить(Метаданные.НайтиПоПолномуИмени("Подсистема.CRMИМаркетинг.Подсистема.Ассортимент"),
								  "Важный");

	// Создание описания варианта "Основной"
	Основной = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	Основной.Наименование = НСтр("ru= 'Неликвидный товар'");
	Основной.Включен = Истина;
	Основной.ВидимостьПоУмолчанию = Истина;
	Основной.Описание = НСтр("ru= 'Количественный и суммовой анализ невостребованных товаров (Филимонов И.В.)'");

	Для Каждого Элемент Из ПодсистемыРазмещения Цикл
		Основной.Размещение.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;

	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Метаданные.Отчеты.ДКА_Неликвиды, Истина);

КонецПроцедуры

#КонецОбласти

#КонецЕсли