//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		

// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавление команды редактирования шаблонов ниаменований на панель администрирования.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура ДобавитьКомандуНаПанельАдминистрирования(Форма) Экспорт

	// Разыменование и константы
	Элементы = Форма.Элементы;
	ИмяЭлементаФормы = "ДКА_ПереименованиеСвойства";
	ТекстЗаголовка = НСтр("ru = 'Переименование свойства'");
	ТекстПодсказки = НСтр("ru = 'Переименование свойства, замена старых наименований в шаблонах наименований номенклатуры'");
	СсылкаКоманды = "e1cib/command/ОбщаяКоманда.ДКА_ПереименованиеСвойства";
	
	// Получение группы размещения
	ГруппаРазмещения = Элементы.Найти("ГруппаОбработкаГрупповоеИзменениеОбъектов");

	// Добавление команды на форму
	КомандаЭлемент = Элементы.Добавить(ИмяЭлементаФормы, Тип("ДекорацияФормы"), ГруппаРазмещения);
	КомандаЭлемент.Заголовок = Новый ФорматированнаяСтрока(ТекстЗаголовка, , , , СсылкаКоманды);
	КомандаЭлемент.Подсказка = ТекстПодсказки;
	КомандаЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;

КонецПроцедуры

#КонецОбласти

#КонецЕсли