//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРасширенныйПоискНоменклатура

&НаСервереБезКонтекста
Процедура ДКА_СписокРасширенныйПоискНоменклатураПриПолученииДанныхНаСервереПосле(ИмяЭлемента, Настройки, Строки)
	ДКА_ПолучитьДанныеНаСервере(ИмяЭлемента, Настройки, Строки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСтандартныйПоискНоменклатура

&НаСервереБезКонтекста
Процедура ДКА_СписокСтандартныйПоискНоменклатураПриПолученииДанныхНаСервереПосле(ИмяЭлемента, Настройки, Строки)
	ДКА_ПолучитьДанныеНаСервере(ИмяЭлемента, Настройки, Строки);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ДКА_ПолучитьДанныеНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Товары = Строки.ПолучитьКлючи();
	
КонецПроцедуры

&ИзменениеИКонтроль("ИзменитьВариантНавигацииЗавершение")
&НаКлиенте
Процедура ДКА_ИзменитьВариантНавигацииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено
		Или ВариантНавигации = Результат.Значение Тогда
		Возврат;
	КонецЕсли;

#Вставка
	Если Результат.Значение = "РасширенныйПросмотр" Тогда
		ДКА_РасширенныйПросмотр = Не ДКА_РасширенныйПросмотр;
		Элементы["ДКА_ПанельОстаткиЦены"].Видимость = ДКА_РасширенныйПросмотр;
		Если ДКА_РасширенныйПросмотр Тогда
			ДКА_СобытияФормКлиент.УстановитьТекущуюСтрокуИерархииНоменклатуры(ЭтотОбъект);
		КонецЕсли;
		Возврат;
	КонецЕсли;
#КонецВставки
	ВариантНавигации = Результат.Значение;
	ВариантНавигацииПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти
