//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

// Возвращает последние цены номенклатуры
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
// 
// Возвращаемое значение:
//  Массив из Структура:
//	* ВидЦены - СправочникСсылка.ВидыЦен - Вид цены
//	* Цена - Число - Цена
Функция ЦеныНоменклатуры(Номенклатура) Экспорт

	НаборЦен = Новый Массив;

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Цены.ВидЦены КАК ВидЦены,
				   |	Цены.Цена КАК Цена
				   |ИЗ
				   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК Цены";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НаборЦен.Добавить(Новый Структура("ВидЦены, Цена", Выборка.ВидЦены, Выборка.Цена));
	КонецЦикла;

	Возврат НаборЦен;

КонецФункции

// Возвращает остатки номенклатуры
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
// 
// Возвращаемое значение:
//  Массив из Структура:
//	* ВидЦены - СправочникСсылка.ВидыЦен - Вид цены
//	* Цена - Число - Цена
Функция ОстаткиНоменклатуры(Номенклатура) Экспорт

	НаборОстатков = Новый Массив;

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
				   |	РаспределениеЗапасов.Характеристика КАК Характеристика,
				   |	РаспределениеЗапасов.Склад КАК Склад,
				   |	СУММА(РаспределениеЗапасов.Свободно) КАК Свободно,
				   |	СУММА(РаспределениеЗапасов.ВНаличии - РаспределениеЗапасов.Свободно) КАК ВРезерве,
				   |	0 КАК ВПути
				   |ИЗ
				   |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
				   |ГДЕ
				   |	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
				   |	И РаспределениеЗапасов.Номенклатура = &Номенклатура
				   |СГРУППИРОВАТЬ ПО
				   |	РаспределениеЗапасов.Номенклатура,
				   |	РаспределениеЗапасов.Характеристика,
				   |	РаспределениеЗапасов.Склад
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
				   |	ТоварыКПоступлениюОстатки.Номенклатура,
				   |	ТоварыКПоступлениюОстатки.Характеристика,
				   |	ТоварыКПоступлениюОстатки.Склад,
				   |	0,
				   |	0,
				   |	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоНакладнымОстаток
				   |ИЗ
				   |	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
				   |ГДЕ
				   |	ТоварыКПоступлениюОстатки.Номенклатура = &Номенклатура";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НаборОстатков.Добавить(Новый Структура("Склад, Свободно, ВРезерве, ВПути",
											   Выборка.Склад,
											   Выборка.Свободно,
											   Выборка.ВРезерве,
											   Выборка.ВПути));
	КонецЦикла;

	Возврат НаборОстатков;

КонецФункции

Функция Применимость(Номенклатура) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
				   |	НоменклатураДополнительныеРеквизиты.Значение КАК Применимость
				   |ИЗ
				   |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
				   |ГДЕ
				   |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
				   |	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство", ПараметрыСеанса.АА_СвойствоНаименованиеПолное);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() И Не ПустаяСтрока(Выборка.Применимость) Тогда
		Результат = СтрЗаменить(Выборка.Применимость, " / ", Символы.ПС);
	Иначе
		Результат = "Модели по автокаталогу не назначены";
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти