//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		

#Область СлужебныеПроцедурыИФункции

//@skip-check extension-variable-prefix
#Область ПроцедурыИФункцииСохраненияИВосстановленияНастроек

// Возвращает структуру - значения настроек формы списка, формы выбора товаров.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка, форма выбора.
//
// Возвращаемое значение:
//	Структура - Значения настроек формы списка, формы выбора.
//
&ИзменениеИКонтроль("НастройкиФормы")
Функция ДКА_НастройкиФормы(Форма)

	НастройкиФормы = Новый Структура;
	
	НастройкиФормы.Вставить("ИспользоватьФильтры", Форма.ИспользоватьФильтры);
	Если Не (Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоТоварамДругогоКачества
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСовместноПродаваемымТоварам
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархииПоставщика) Тогда
		
		НастройкиФормы.Вставить("ВариантНавигации", Форма.ВариантНавигации);
	Иначе
		НастройкиФормы.Вставить("ВариантНавигации", Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПустаяСсылка());
	КонецЕсли;
	НастройкиФормы.Вставить("ВидНоменклатуры", Форма.ВидНоменклатуры);
	НастройкиФормы.Вставить("ТекущаяИерархияНоменклатуры", Форма.ТекущаяИерархияНоменклатуры);
		
	// Сохранение параметров отбора.
	Если ПодборТоваровКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма)
		Или ПодборТоваровКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма) Тогда
		
		НастройкиФормы.Вставить("ТаблицаПараметровОтбора", Форма.ТаблицаПараметровОтбора.Выгрузить());
		НастройкиФормы.Вставить("НоменклатураИсходногоКачества", Форма.НоменклатураИсходногоКачества);
		
	КонецЕсли;
	
	НастройкиФормы.Вставить("ВариантПоискаТоваровУстановлен", Истина);
#Вставка
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаСписка" Тогда
		ИмяРеквизитаРасширенныйПросмотр = "ДКА_РасширенныйПросмотр";
		НастройкиФормы.Вставить(ИмяРеквизитаРасширенныйПросмотр, Форма[ИмяРеквизитаРасширенныйПросмотр]);
	КонецЕсли;
#КонецВставки

	Возврат НастройкиФормы;

КонецФункции

#КонецОбласти

#КонецОбласти