//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		

#Область ПрограммныйИнтерфейс

// Инициализирует на форма таблицу "Выбранные цены"
// 
// Дополнительно к стандартной процедуре производится заполнение ТЧ Товары переданной
// в форму через массив ссылок номенклатуры "Параметры.Товары" номенклатурой
// 
// Дописка сделана в этом модуле с целью исключить модификации формы документа УстановкаЦенНоменклатуры
// в расширении и необходимостью заполнить ТЧ Товары до вызова метода ЗаполнитьДокумент() в обработчике
// ПриСозданииНаСервере формы документа (названный метод заполняет ДеревоЦен).
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  МассивВидовЦен - Массив из СправочникСсылка.ВидыЦен
//                 - Массив из СправочникСсылка.ВидыЦенПоставщиков
//  ТаблицаВидовЦен - ТаблицаЗначений - таблица видов цен
//
&После("ИнициализироватьВыбранныеЦены")
Процедура ДКА_ИнициализироватьВыбранныеЦены(Форма, МассивВидовЦен, ТаблицаВидовЦен) Экспорт

	Если Не ЭтоРегистрацияЦенПоставщика(Форма) И Форма.Параметры.Свойство("Товары") Тогда

		Для Каждого Эл Из Форма.Параметры.Товары Цикл
			НовыйТовар = Форма.Объект.Товары.Добавить();
			НовыйТовар.Номенклатура = Эл;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти