//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		

#Область ПрограммныйИнтерфейс

// Предназначена для внесения изменений в форму Обслуживание обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
&После("ОбслуживаниеПриСозданииНаСервере")
Процедура ДКА_ОбслуживаниеПриСозданииНаСервере(Форма) Экспорт
	
	Обработки.ДКА_РедактированиеШаблоновНаименованийНоменклатуры.ДобавитьКомандуНаПанельАдминистрирования(Форма);
	
КонецПроцедуры

#КонецОбласти
